/******************************************************************************
 * Author: 郑猿冰- zyb_hust@163.com
 * Description: --  错误代码等统一管理
 * Last modified: 2017-12-18 18:35
******************************************************************************/

module.exports = {
  401: '认证失效了，请先登录!',
  1001: '{field}不合法',
  1002: '不是有效的json数据',
  1003: '文件解压失败，没有{field}类型的解压单元',
  1004: '模型文件存储失败，不支持{field}类型的存储引擎',
  3001: '页面已经跳转',
  5001: '{field}不符合要求',
  14001: 'mongodb数据库配置{field}不存在',
  40010: '{field} 不是有效的Function',
  40011: '接口不存在',
  40012: '接口没提供 {v} 版本',
  40021: '不是有效的json数据',
  41001: '模型字典{field}未定义',
  50000: '接口异常',
  50001: '图片保存失败了'
};
